### Terraform `plan` Succeeded for Workspace: `default`
  
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_blob.training_content_blobs["../web_content/404.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "8d1bcfffa202fbbad54f35f865d1dcd0" -> "5333c0f6f989782708b4d009620dc626" # forces replacement
!       id                     = "https://tamughtrndanwmay.blob.core.windows.net/$web/404.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "404.html"
!       url                    = "https://tamughtrndanwmay.blob.core.windows.net/$web/404.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.training_content_blobs["../web_content/index.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "d9d2a3b936d7ff85585f955faeefd05f" -> "30eb5e59aa302a656787d1c58cab5feb" # forces replacement
!       id                     = "https://tamughtrndanwmay.blob.core.windows.net/$web/index.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "index.html"
!       url                    = "https://tamughtrndanwmay.blob.core.windows.net/$web/index.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>
  